src/Documents/СписаниеСРасчетногоСчета/СписаниеСРасчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСРасчетногоСчета</name>
  <registerRecords>AccumulationRegister.Поставщики</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Банк</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучатель</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидыОперацийСписаниеДенежныхСредств/ВидыОперацийСписаниеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСписаниеДенежныхСредств</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ПрочееСписание</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаСчетМиша</name>
  </enumValues>
</mdclass:Enum>

src/Documents/СписаниеСРасчетногоСчета/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Объект.ВидОперации	= Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание;
		Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие расходы");
		Объект.Счет			= Справочники.Счета.НайтиПоНаименованию("Карточка VISA Сбер (Владимир)");
		Объект.Валюта		= Объект.Счет.ВалютаДенежныхСредств;
		
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФлагомВлючатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	а2 = Объект.Статья.НеВключатьВРасходы;
	
	Объект.НеВключатьВРасходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 		= (Объект.Валюта.Код <> "643");
	Элементы.СчетПолучатель.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет);
	Элементы.Контрагент.Видимость		= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	Элементы.Назначение.Видимость		= (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);

КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	Объект.Валюта = Объект.Счет.ВалютаДенежныхСредств;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВлючатьВДоходыРасходы();
	
КонецПроцедуры
